Revit 2026 API

# ParameterTypeIdRbsEnergyAnalysisViewSurfacesMode Property

---

"Show Surfaces"

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static ForgeTypeId RbsEnergyAnalysisViewSurfacesMode { get; }
```
```vb
Public Shared ReadOnly Property RbsEnergyAnalysisViewSurfacesMode As ForgeTypeId
	Get
```
```cpp
public:
static property ForgeTypeId^ RbsEnergyAnalysisViewSurfacesMode {
	ForgeTypeId^ get ();
}
```
```fsharp
static member RbsEnergyAnalysisViewSurfacesMode : ForgeTypeId with get
```

#### Property Value

ForgeTypeId

#### Reference

ParameterTypeId Class

Autodesk.Revit.DB Namespace